import 'package:flutter/material.dart';


class Advice extends StatefulWidget {
  const Advice({Key? key}) : super(key: key);

  @override
  State<Advice> createState() => _AdviceState();
}

class _AdviceState extends State<Advice> {

  List data = [
    """الرضاعة الطبيعية للطفل حديث الولادة
حاولي إرضاع طفلك سريعاً بعد الولادة  تعزز الرضاعة الطبيعية من مناعة صغيرك تمده بالفيتامينات والمعادن الهامة كما أن الرضاعة الطبيعية واحتضان الطفل خلالها  تساعد في إشعاره بالأمان والحب مما يعمل على تحسين نفسية الطفل مستقبلاً وتقلل من مشاعر الإضطراب كما أن كثرة احتضان الطفل تزيد من الثقة بالنفس.
في حالة كانت لديك مشكلة تمنعك من الرضاعة الطبيعية فلا بأس في ذلك تواصلي مع الطبيب لوصف نوع لبن صناعي متكامل العناصر يناسب طفلك ولا تفوتي مواعيد الرضعات مع الاهتمام بتنظيف الأدوات المستخدمة في إرضاع الطفل وتعقيمها جيدا بالماء المغلي مع الخل وإعادة غسلها مرة أخرى بالماء المغلي وتجفيفها بعد كل مرة وذلك لمنع حدوث مشاكل صحية للطفل في هذه الفترة نظراً لضعف مناعة الطفل الرضيع
""",
    """
 احرصي على الالتزام بجميع التطعيمات في أوقاتها
التطعيمات  لا غنى عنها للحفاظ على صحة صغيرك وتقوية مناعته ضد الأمراض، ويجب معرفة التطعيمات الإضافية التي يمكن إعطاؤها للمولود لزيادة العناية به، كما يجب الاهتمام بالطفل بعد إعطائه التطعيمات التي تقدمها المراكز الطبية، وذلك لأن الطفل قد ترتفع لديه درجة الحرارة فيجب متابعة حرارة الطفل والاهتمام بوضع كمادات المياه الباردة في الأماكن المخصصة على جسم الطفل.
يستخدم دواء خافض الحرارة الخاص بالأطفال والذي يصفه المختص في وحدات إعطاء التطعيمات، كما أنه تختلف الجرعات من طفل لآخر، ولذا يجب السؤال عن الجرعة المناسبة لطفلك حسب وزنه.
يقدم مركز أندلسية لصحة الطفل باقات تضم جميع التطعيمات التي يحتاجها الطفل في جميع مراحل حياته بداية من عمر يوم واحد، يمكنك التواصل مع الطبيب بخصوص الأمر.
""",
    """
نصائح لتسهيل نوم الطفل وراحته
من المعروف أن الأطفال حديثي الولادة لا تنتظم لديهم ساعات النوم، فقد تجدهم ينامون نهاراً و يظلون مستيقظين أثناء الليل، ولكن

لا داعي للقلق فهذا الأمر سرعان ما ينضبط مع مرور الوقت، ومن الممكن على الأم أن تساعد طفلها في تنظيم عملية النوم من خلال

تحميم الطفل قبل محاولة النوم واستخدام شامبو أطفال ليلي برائحة تساعد على الاسترخاء مثل اللافندر.
دلكي جسم رضيعك بزيت أطفال أو لوشن ليلي يساعده على النوم.
تغيير الحفاض قبل النوم أيضاً في حالة عدم تحميم الطفل.
إطفاء الأنوار في الغرفة.
منع الأصوات والضوضاء.
إرضاع الطفل بشكل مشبع قبل النوم مباشرة.
مساعدة الطفل في عملية التجشؤ عن طريق إمالة الطفل على كتف الأم و الطبطبة الخفيفة على ظهر الطفل.
تساعد عملية تجشؤ الرضيع في النوم الهادئ لأنها تساعد الرضيع في إخراج الهواء الذي تم بلعه أثناء عملية الرضاعة، مما يقلل من الغازات في الطفل الرضيع ويساعد ذلك في تقليل الشعور بالمغص ما يساهم في النوم العميق للطفل والنمو أيضاً.
احتضان الطفل أثناء الرضاعة من الأمور التي تطمئن الرضيع وتجعله يذهب في نوم عميق.
قد لا تنجح المحاولات دائماً وخاصة في الشهور الأولى، ولكن مع تكرار المحاولة تحصلين على نتيجة جيدة شيئاً فشيئاً. 

في حالة شعور الطفل بالانزعاج، تفقدي الحفاض أو دلكي بطنه بلطف لإزالة الانتفاخات التي عادة ما تصيب حديثي الولادة..

يمكن إعطاء الطفل قبل النوم أدوية المغص والانتفاخات للحصول على نوم هادئ بالتأكيد بعد استشارة طبيبك.""",
    """
احرصي على النصائح التالية وأنتِ تحممين رضيعك 

استخدمي صابون أو شامبو الاستحمام المخصص للأطفال الرضع  للحفاظ على بشرته من التهيج والاحمرار. 
لا تتركي صغيرك في الماء فترة طويلة لتجنب إصابته بنزلات البرد.
لا تحمميه أول يومين بعد الولادة. """,
    """
الاهتمام بمنطقة السرة
يجب رش الكحول المخصص للأطفال على منطقة السرة في الأسبوع الأول لكي تنشف وتسقط من تلقاء نفسها.
إذا لاحظتي وجود إفرازات حول منطقة السرة بعد مرور الأسبوع الأول من ولادة الطفل، يجب في هذه الحالة متابعة الأمر مع الطبيب المختص.""",
    """
الاهتمام بمنطقة الحفاض
يجب تغيير الحفاض في أوقات متقاربة.
غسل الطفل بماء فاتر جيداً وبرفق.
تجفيف منطقة الحفاظ جيدا برفق شديد.
استخدام كريم خاص بـ الحفاضات للأطفال حديثي الولادة وابتعدي عن الكريمات العطرية لأنها قد تسبب تهيجاً لبشرة صغيرك.""",
    """
تمارين للاطفال الرضع
يوجد بعض التمارين التي تعمل على مساعدة الطفل في فرد جسده.
امسكى بيد طفلك بأصابعك وهو على ظهره، ثم قومي بسحب اليدين تجاهك وارجاعهما دون شد الطفل من على الأرض.
تمرين العجلة للارجل يناسب الطفل من سن ثلاثة أشهر، ويعمل على مساعدة الطفل في فرد وتقوية الأرجل.
عمل مساج للبطن للطفل وخاصة بعد الرضاعة وقبل النوم يساعد في التخلص من الانتفاخات، ويساعده في نوم هاديء ويقلل من نوبات بكاء الطفل التي توجد بسبب الشعور بالمغص الناتج عن الغازات. 
""",
    """
طريقة غسيل ملابس المواليد
بما أن الأطفال حديثي الولادة مناعتهم ضعيفة مقارنة بالبالغين فإن من طرق العناية بالطفل حديث الولادة هي غسل ملابسه منفردة ولا يتم غسلها مع ملابس الآخرين حتى لا يصاب بالعدوى.
يمكن استخدام بعض المطهرات في غسل ملابس الرضيع والتي تساعد في قتل الميكروبات والبكتيريا التي قد تؤذي جلد الرضيع.
تجفف في الشمس ثم تكوى لقتل أي نوع من الميكروبات من الممكن أن يتسبب في حدوث أمراض جلدية للطفل.
""",

    """
وأخيراً اهتمي بصحتك لأجل صغيرك! 

حالتك النفسية والجسدية تؤثر على صغيرك بشكل كبير، ابتعدي عن التوتر والقلق قدر الإمكان وفي حالة واجهتك أزمة نفسية يصعب عليكِ التعامل معها لا تترددي في طلب المساعدة، يقدم الأطباء بمركز أندلسية لصحة المرأة جميع وسائل الدعم الممكنة للمرأة خاصة في فترات الحمل والرضاعة لتصبح بأفضل صحة نفسية وجسدية لتستطيع الاهتمام بمولودها ولتحيا بسعادة كذلك 
اهتمي بالتغذية السليمة التي تساعد طفلك في الحصول على كافة العناصر الغذائية اللازمة له وحاولي ممارسة الرياضة ولو لدقائق يومياً. 
""",
    """
ممنوعات وخرافات حول العناية بالطفل الرضيع 
لا تستمعي إلى نصائح الآخرين حول محاولة إدخال أي أطعمة إلى رضيعك قبل إتمام الستة أشهر الأولى من عمره.
يحذر إعطاء الطفل العسل على أساس أنه سيعالج المغص، هذا الكلام غير صحيح حيث يوجد بالعسل نوع من أنواع البكتيريا لا تستطيع معدة الرضيع التعامل معه، ولذا فإن العسل لا يفضل إدخاله للرضيع قبل مرور سنة من عمره.
لا يفضل إعطاء اعشاب للطفل أيضاً خلال السنة الأولى ويفضل استشارة الطبيب في حالة الاضطرار إلى ذلك، وعند إعطاء الطفل اعشاب تساعد في اراحته يفضل أن تكون من الصيدلية معقمة حتى لا تسبب للطفل أضرار على صحته.
صحتك وصحة رضيعك أمانة كبيرة فاجتهدي في الحفاظ عليها واطلبي المساعدة من المختصين دائماً لتحصلي على أفضل النتائج التي  قد تغير حياتك وحياة طفلك وأسرتك كلها للأفضل.
""",

"""7. تدليك جسم الطفل حديث الولادة - مساج الطفل أو أيام الولادة
أثبتت الدراسات أن تدليك جسم الطفل يساعده على الاسترخاء ويُحسّن من أنماط نومه ويُهدّئه عندما يكون عصبياً. كما أن تدليكك لجسم طفلك يعتبر وسيلةً رائعة لتوثيق الارتباط بينكما، وهو روتين سهل القيام به.""",
    """مع بلوغ طفلك عامه الثالث، يكتمل نمو دماغه بنسبة %85؛ وكل تجربة يعيشها حتى يصل لهذا السن تساعد على تشكيل دماغه. وكل الخبرات متعددة الحواس المتكررة والمستمرة والمفيدة والتي يمكن التنبؤ بها، قد تساعد طفلك في تطوره الصحي.

لذا عليك ألا تقلقي كثيراً مما إذا كنتِ تقومين بالأشياء "بالطريقة الصحيحة"، فأهم شيء هو أن تقضي كثيراً من الوقت مع طفلك الصغير لتحفّزي حاستي اللمس والشم لديه، الأمر الذي يساعد على توثيق ارتباطكما بشكلٍ أفضل في حين ينعم الطفل بتطورٍ صحي.""",
    """يبكي معظم الأطفال ساعتين يومياً في المتوسط في أول ثلاثة أشهر. لذلك فرغم أن الأمر قد يبدو مزعجاً، فهو في الحقيقة طبيعي أيضاً.

لتهدئة طفلك، حاولي أولاً تحديد سبب شعوره بعدم الراحة. هل طفلك جائع؟ هل لديه مغص أو غازات في بطنه؟ هل يحتاج لتغيير الحفاض؟ هل حان الوقت ليغفو قليلاً؟ هل هناك إثارة مفرطة لطفلك ناتجة عن ضوضاء أو أضواء أو حركة صاخبة؟

للمساعدة في تهدئة طفلك الذي يشعر بالنعاس أو الإثارة المفرطة، عليك بحمل طفلك على كتفيك وهزّه بلطف. غنّي أو تحدّثي برقة لطفلك لطمأنته بصوت هادئ. ويمكنك أيضاً تمرير يدك على ظهر طفلك وأنت تقومين بذلك. جرّبي أوضاع مختلفة لتكتشفي الوضع المناسب لكما.

شيءٌ آخر يجب مراعاته: لا يكون طفلك في أسابيعه القليلة الأولى قد اكتسب قدرةً حركيةً كبيرة، ولذلك فقد يبكي طلباً للمساعدة إذا كانت وضعيته في المهد غير مريحة له. ويمكنك المساعدة في توفير الراحة لطفلك من خلال تغيير وضعيته. ولكن لسلامته، عليك دائماً أن تضعيه على ظهره عند النوم.""",
    """يُجمِع العديد من خبراء الصحة أنه لا يوجد شيء أفضل للطفل حديث الولادة من لبن الأم. وإذا تحدثنا من منظور القيمة الغذائية، فهذا اللبن الطبيعي مُعد طبيعياً ليناسب طفلك الرضيع. ونحن نعلم بالتأكيد أن بعض الأمهات قد لا يتمكّن من إرضاع أطفالهن طبيعياً، بسبب مشكلات صحية أو ظروف خاصة أخرى. لذا ننصحك بمناقشة الأمر مع طبيب الأطفال لتعرفي أفضل طريقة لتغذية طفلك حديث الولادة.

بغض النظر عن طريقة إرضاعك لطفلك، احرصي دائماً على حمل طفلك أثناء إرضاعه. فاحتضانك لطفلك أثناء إرضاعه يساعد على بناء علاقة ارتباط قوية وحنونة بينك وبين طفلك.""",
""" تجنب إطعامهم حليب البقر
يجب تغذية المولود الجديد من حليب الأم لمدة 12 شهرًا على الأقل وفقًا لإرشادات المراكز الأمريكية لمكافحة الأمراض والوقاية منها، فإن تغذية طفلك حديث الولادة بحليب البقر قد يعرضه أو تعرضها لخطر النزيف المعوي. 
أيضًا ، يحتوي حليب البقر على الكثير من البروتينات والمعادن بحيث يتعذر على جسم طفلك التعامل معها ولايحتوي على النوع الصحيح من العناصر الغذائية اللازمة لنمو الطفل.""",

  """ لا تعطي الماء قبل 6 أشهر
وفقًا لإرشادات اليونيسف لتنمية الطفل، خلال الأشهر الستة الأولى، لا يحتاج الطفل إلى الماء حيث يتم توفير المتطلبات الغذائية للمياه عن طريق لبن الأم وحده كما أن جهازهم الهضمي ليس بهذه القوة لمعالجة هذا القدر من السوائل.""",

    """لا تعطي الطعام الصلب قبل 6 أشهر
تقول إرشادات اليونيسف إن إدخال أطعمة أو سوائل غير لبن الأم لطفلك قبل أن يبلغ من العمر 6 أشهر يمكن أن يزيد من خطر الإصابة بالأمراض، مثل الإسهال ، الذي يمكن أن يجعله ضعيفًا ونحيفًا ، بل وقد يهدد حياته. قد يقل معدل الرضاعة لطفلك أيضًا، لذلك قد تنخفض كمية الحليب، وهو طعامه الأكثر أهمية. 
 
حليب الأم هو الغذاء الأكثر أمانًا وصحة خلال الأشهر الستة الأولى من الحياة لجميع الأطفال في كل مكان.""",


    """التفكير في تناول المكمّلات الغذائية التي تحتوي على فيتامين D
اسألي طبيب طفلكِ عن المكمّلات الغذائية التي تحتوي على فيتامين D، خاصة إذا كنتِ ترضعين طفلكِ طبيعيًا. فقد لا يوفر حليب الثدي ما يكفي من فيتامين D لمساعدة جسم طفلك على امتصاص الكالسيوم والفوسفور، وهما من العناصر المغذية الضرورية لبناء عظام قوية.""",
    """توقعي التنوع في أنماط تناول الطعام لطفلكِ حديث الولادة
لن يتناول طفلكِ حديث الولادة بالضرورة المقدار نفسه كل يوم. أثناء طفرات النمو — غالبًا بعد أسبوعين أو ثلاثة أسابيع من الولادة — قد يتناول طفلكِ حديث الولادة مقدارًا أكبر في كل رضعة أو عددًا أكثر من الرضعات. استجيبي لمؤشرات الجوع المبكرة، بدلاً من الالتزام بصرامة بالمواعيد المحددة.""",
    """ ثقي بغريزتك وغريزة مولودك
قد تشعرين بالقلق بسبب عدم تناول طفلكِ حديث الولادة ما يكفيه من الغذاء، لكن الأطفال يعرفون عادة الكمية التي يحتاجون إليها. لا تركزي على الكمية التي يتناولها طفلكِ حديث الولادة أو عدد الوجبات أو مدى انتظامها. بل ابحثي عما يلي:

الزيادة المطردة في الوزن
الهدوء بين وجبات الإرضاع
استهلاك ست حفاضات والتبرّز ثلاث مرات أو أكثر يوميًا بحلول اليوم الخامس من الولادة
اتصلي بالطبيب إذا كان طفلك حديث الولادة لا يزداد وزنه أو يستهلك أقل من ست حفاضات في اليوم أو يظهر اهتمامًا أقل بالرضاعة.""",
    """فكري في أن كل وجبة بمنزلة وقت لزيادة الترابط مع طفلكِ حديث الولادة
قربي طفلكِ حديث الولادة منك في أثناء كل رضعة. وانظري في عينيه. تحدثي إليه بصوت هادئ. استغلي كل وجبة إرضاع بوصفها فرصة لبناء الشعور بالأمان والثقة والراحة لدى طفلكِ حديث الولادة.""",
    """حافظي على انتظام الوجبات
إذا كان أفراد الأسرة الآخرون القائمون على الرعاية سيطعمون طفلك بعض الوقت، فتأكدي من أنهم يتبعون ذات نظام التغذية والأساليب التي تتبعينها أنتِ.""",
    """تعرّفي على الوقت اللازم لطلب المساعدة
إذا كنتِ تعانين من مشكلة في الرضاعة الطبيعية، فاطلبي المساعدة من استشاري الرضاعة أو طبيب طفلكِ، خاصة إذا كانت كل رضعة تسبب لكِ ألمًا أو وزن طفلكِ لا يزيد بصورة طبيعية. إذا لم تتمكني من الذهاب إلى استشاري الرضاعة، فاطلبي من طبيب طفلكِ إحالتكِ إلى طبيب متخصص، أو راجعي الأمر مع قسم التوليد في مستشفى محلي.""",

  """وفر لطفلك طرقًا يستطيع بها النظر والسمع وتحريك الذراعين والساقين بحرية ولمسك. تلامس البشرة يعتبر أيضًا من الأمور الجيدة للغاية ويمكن القيام به من وقت لآخر. ينبغي أن ترى ذراعي طفلك وساقيه يتحركان بطريقة متقطعة. يتعلم طفلك ببطء كيفية التحكم في حركته.""",
    """انظر في عيني طفلك، وابتسم ردًا على ابتسامة الطفل عن طريق مراقبة تعبيرات وجهه. ينبغي أن ترى طفلك يتفاعل بصورة إيجابية مع تعبيرات وجهك وحركاتك وإشاراتك. يتعلم طفلك التواصل وتبدأ في رؤيته يستجيب لك حتى قبل الولادة.""",
    """هدئ طفلك ودلكه واحتضنه برفق. سوف ترى طفلك هادئًا وسعيدًا بأن يُحتضَن ويهدهد.""",
    """لامس جلدك بجلد طفلك من آنٍ إلى آخر. ينبغي أن تحس بأن طفلك يشعر بالأمان وبالهدوء حين يلمس وجودك ويسمعه ويشمه.""",
    """تحدث إلى الطفل عن طريق نغمات صوتية جميلة و‘حديث الأطفال‘. ينبغي أن يتواصل الأب والأم مع طفلهما حديث الولادة. سوف تلاحظ أن طفلك يستطيع سمعك وسوف يبدأ في وقت قريب في حفظ كلماتك وترديدها.""",

    """يمكنك تغيير نغمات صوتك برفق لكي تجعلها بطيئة أو سريعة، أو مرتفعة أو منخفضة، أو هادئة أو عالية. يمكنك مراقبة رد الفعل على وجه طفلك وجسمه وملاحظة تفاعله معك.""",
    """ضع الطفل على بطنه. هز خشخيشة أو جرس أمامه وارفعها ببطء لمسافة قليلة. سوف يشجعه ذلك على رفع رأسه وكتفيه لكي يشاهدها تتحرك. سوف يساعد ذلك الطفل على تتبع حركة الخشخيشة بعينيه والتدرب على رفع رأسه وكتفيه. في الوقت نفسه، سوف يستمع إلى الصوت الذي تصدره الخشخيشة.""",

  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Theme
          .of(context)
          .splashColor,
      appBar: AppBar(
        elevation: 0,
        backgroundColor: Theme
            .of(context)
            .splashColor,
        centerTitle: true,
        leading: InkWell(
          onTap: () {
            Navigator.of(context)
                .pop();
          },
          child: Icon(
            Icons.arrow_back,
            color: Theme
                .of(context)
                .secondaryHeaderColor,
            size: 28,
          ),
        ),
        title: Text(
          'Advices',
          style: TextStyle(
              fontWeight: FontWeight.bold,
              fontSize: 25,
              color: Theme
                  .of(context)
                  .secondaryHeaderColor),
        ),
      ),
      body: Container(
        padding: const EdgeInsets.all(10),
        decoration: const BoxDecoration(
          color: Colors.white,
          image: DecorationImage(
              image: AssetImage('asset/Images/b.png'), opacity: 0.3),
          borderRadius: BorderRadius.only(
              topLeft: Radius.circular(30.0), topRight: Radius.circular(30.0)),
        ),
        child: ListView.separated(
          itemBuilder: (context, index) =>
              Container(
                padding: const EdgeInsets.all(20),
                decoration: BoxDecoration(
                  borderRadius: const BorderRadius.only(
                      topLeft: Radius.circular(30),
                      topRight: Radius.circular(30),
                      bottomLeft: Radius.circular(30),
                      bottomRight: Radius.circular(30)),
                  color: Theme
                      .of(context)
                      .splashColor,

                ),
                child: Row(
                  children: [
                    Flexible(
                      child: Text( data[index],
                        maxLines: 9,
                        style: TextStyle(
                            overflow: TextOverflow.ellipsis,
                            color: Theme
                                .of(context)
                                .secondaryHeaderColor,
                            fontSize: 16,
                            fontWeight: FontWeight.bold),
                      ),
                    )
                  ],
                ),
              ),
          itemCount: data.length,
          separatorBuilder: (BuildContext context, int index) => const SizedBox(
            height: 10,),
        ),
      ),
    );
  }
}
